tap "felixKratz/formulae"
tap "homebrew/cask"
tap "homebrew/core"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Insanely fast image printing in your terminal
brew "catimg"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Powerful, lightweight programming language
brew "lua"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Package manager for the Lua programming language
brew "luarocks"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Deprecated because it does not pass the macOS Gatekeeper check! It will be disabled on 2026-09-01.
cask "alacritty"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# JetBrains Mono
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleratio
cask "ghostty"
# Web browser
cask "google-chrome"
# File archiver
cask "keka"
# Replacement for Docker Desktop
cask "orbstack"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
